# 9.1 Customer Data set, data checks & merging

Contents

1. Importing libraries
2. Importing Data
3. Examine the customer dataframe
4. Data Wrangling
    4.1 Renaming columns
    4.2 Reducing data types 
5. Data Consistency Checks  
6. Merge Customer data with df_orders
7. Export data

#01 Importing libraries

In [1]:
#Import libraries
import pandas as pd
import numpy as np
import os

#02 Importing Data

In [2]:
#Folder Path
path = r'C:\Users\Caroline\Documents\Career Foundry\03 2023 Instacart Basket Analysis'

In [5]:
#import customers dataset as df
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [34]:
#import orders_products_merged.pkl as df_orders
df_orders = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merge_withflags.pkl'))

In [35]:
#check df_orders after importing
df_orders.shape

(32404859, 23)

#03 Examine the customer dataframe

In [6]:
# determine intial number of rows & columns of dataframe
df.shape

(206209, 10)

In [7]:
# Print the first 5 rows of your dataframe.
df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
# Determine the initial descriptive statistic of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [12]:
df.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

#04 Data Wrangling

Dropping columns - The First Name and Surnam columns are not relevant for data analysis and can be dropped. 'user_id' will provide a unique identifier.

In [14]:
# drop First Name and Surnam columns
df_dropped = df.drop(columns = ['First Name' , 'Surnam'])

#04.1 Renaming columns

In [17]:
#rename 'STATE' to 'state'  'fam_status' to 'family_status'
df_dropped.rename(columns = {'STATE' : 'state' }, inplace = True)

In [18]:
#rename 'Gender' to 'gender'
df_dropped.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [19]:
#rename 'Age' to 'age'
df_dropped.rename(columns = {'Age' : 'age'}, inplace = True)

In [20]:
#rename 'n_dependants' to 'number_dependants'
df_dropped.rename(columns = {'n_dependants' : 'number_dependants'}, inplace = True)

In [21]:
#rename 'fam_status' to 'family_status'
df_dropped.rename(columns = {'fam_status' : 'family_status'}, inplace = True)

In [22]:
#check the dataframe
df_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  int64
 1   gender             206209 non-null  object
 2   state              206209 non-null  object
 3   age                206209 non-null  int64
 4   date_joined        206209 non-null  object
 5   number_dependants  206209 non-null  int64
 6   family_status      206209 non-null  object
 7   income             206209 non-null  int64
dtypes: int64(4), object(4)
memory usage: 12.6+ MB

#04.2 Reducing data types

In [23]:
df_dropped.describe()

             user_id            age  number_dependants         income
count  206209.000000  206209.000000      206209.000000  206209.000000
mean   103105.000000      49.501646           1.499823   94632.852548
std     59527.555167      18.480962           1.118433   42473.786988
min         1.000000      18.000000           0.000000   25903.000000
25%     51553.000000      33.000000           0.000000   59874.000000
50%    103105.000000      49.000000           1.000000   93547.000000
75%    154657.000000      66.000000           3.000000  124244.000000
max    206209.000000      81.000000           3.000000  593901.000000

In [24]:
#change the data type of 'age' and 'number_dependants' to int8
df_dropped['age'] = df_dropped['age'].astype('int8')
df_dropped['number_dependants'] = df_dropped['number_dependants'].astype('int8')

In [48]:
#change the data type of 'user_id' to string and 'income' to int32
df_dropped['user_id'] = df_dropped['user_id'].astype('str')
df_dropped['income'] = df_dropped['income'].astype('int32')

In [49]:
#check the dataframe 
df_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   user_id            206209 non-null  object
 1   gender             206209 non-null  object
 2   state              206209 non-null  object
 3   age                206209 non-null  int8
 4   date_joined        206209 non-null  object
 5   number_dependants  206209 non-null  int8
 6   family_status      206209 non-null  object
 7   income             206209 non-null  int32
dtypes: int32(1), int8(2), object(5)
memory usage: 9.0+ MB

#05 Data Consistency Checks

In [40]:
#examine the dataframe for accuracy
df_dropped.describe()

                 age  number_dependants         income
count  206209.000000      206209.000000  206209.000000
mean       49.501646           1.499823   94632.852548
std        18.480962           1.118433   42473.786988
min        18.000000           0.000000   25903.000000
25%        33.000000           0.000000   59874.000000
50%        49.000000           1.000000   93547.000000
75%        66.000000           3.000000  124244.000000
max        81.000000           3.000000  593901.000000

Minimum, mean, and maximum values all look reasonable.

In [29]:
# to find missing values 
df_dropped.isnull().sum()

user_id              0
gender               0
state                0
age                  0
date_joined          0
number_dependants    0
family_status        0
income               0
dtype: int64

In [30]:
# check for full duplicates
df_dups = df_dropped[df_dropped.duplicated()]

In [31]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_dependants, family_status, income]
Index: []

No full duplicates in the dataframe, contine to use df_dropped

In [32]:
# Search for mixed data types in df_dropped
for col in df_dropped.columns.tolist():
  weird = (df_dropped[[col]].applymap(type) != df_dropped[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_dropped[weird]) > 0:
    print (col)
print ('test complete - this statement will always print')

test complete - this statement will always print

Customer dataframe has no missing values, no duplicates, and no mixed data types.

#06 Merge Customer data with df_orders

In [43]:
#check the df_orders for user_id data type 
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    object
 2   order_number               int8
 3   orders_day_of_week         int8
 4   order_hour_of_day          int8
 5   days_since_prior_order     float16
 6   product_id                 int32
 7   add_to_cart_order          int16
 8   reordered                  int8
 9   product_name               object
 10  department_id              int8
 11  prices                     float32
 12  aisle_id                   int16
 13  price_range_loc            object
 14  busiest_day                object
 15  busiest_period             object
 16  busiest_period_of_the_day  object
 17  max_order                  int8
 18  loyalty_flag               object
 19  mean_spending              float32
 20  spending_flag              object
 21  order_freq_flag            object
 22  median_order_freq          float16
dtypes: float16(2), float32(2), int16(2), int32(2), int8(6), object(9)
memory usage: 3.3+ GB

In [41]:
# Merge df_orders and df_dropped. Indicator = true to check if data is present in both dataframes
df_merged = df_orders.merge(df_dropped, on = 'user_id', indicator = True)

In [42]:
#Check output of merged dataframes
df_merged.head()

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, product_id, add_to_cart_order, reordered, product_name, department_id, prices, aisle_id, price_range_loc, busiest_day, busiest_period, busiest_period_of_the_day, max_order, loyalty_flag, mean_spending, spending_flag, order_freq_flag, median_order_freq, gender, state, age, date_joined, number_dependants, family_status, income, _merge]
Index: []

[0 rows x 31 columns]

In [46]:
# Strip the column(s) you're planning to join with
df_orders['user_id'] = df_orders['user_id'].str.strip()

In [50]:
# Strip the column(s) you're planning to join with
df_dropped['user_id'] = df_dropped['user_id'].str.strip()

In [51]:
# Merge df_orders and df_dropped. Indicator = true to check if data is present in both dataframes
df_merged = df_orders.merge(df_dropped, on = 'user_id', indicator = True)

In [52]:
#Check output of merged dataframes
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,order_freq_flag,median_order_freq,gender,state,age,date_joined,number_dependants,family_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,20.5,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,20.5,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,20.5,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,20.5,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,20.5,Female,Alabama,31,2/17/2019,3,married,40423,both

In [53]:
# Check value count for '_merge' column
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [57]:
# drop '_merge' column
df_merged = df_merged.drop(columns = ['_merge'])

In [58]:
#Check df_merged_large for file size
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 30 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    object
 2   order_number               int8
 3   orders_day_of_week         int8
 4   order_hour_of_day          int8
 5   days_since_prior_order     float16
 6   product_id                 int32
 7   add_to_cart_order          int16
 8   reordered                  int8
 9   product_name               object
 10  department_id              int8
 11  prices                     float32
 12  aisle_id                   int16
 13  price_range_loc            object
 14  busiest_day                object
 15  busiest_period             object
 16  busiest_period_of_the_day  object
 17  max_order                  int8
 18  loyalty_flag               object
 19  mean_spending              float32
 20  spending_flag              object
 21  order_freq_flag            object
 22  median_order_freq          float16
 23  gender                     object
 24  state                      object
 25  age                        int8
 26  date_joined                object
 27  number_dependants          int8
 28  family_status              object
 29  income                     int32
dtypes: float16(2), float32(2), int16(2), int32(3), int8(8), object(13)
memory usage: 4.5+ GB

#07 Export data

In [59]:
#Export df_merged in .pkl format
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'instacart_data_all.pkl'))